UKS/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКабинет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыпускПроектов</name>
    <comment>Ответсвтенный за выпуск пректов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

UKS/src/CommonModules/ОбщийСопоставлениеСотрудниковсЗУП/Module.bsl
&наСервере
Функция ПолучитьПодключениеКФайловойБД() 

	ПараметрыПодключения = "File=""D:\1C83Kadry"";Usr=""Администратор"";Pwd=""0""";
	V83COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Возврат V83COMConnector.Connect(ПараметрыПодключения);
	Исключение
		ОбщийСправочникиКлиентСервер.СообщитьПользователю("Ошибка подключения: "+ОписаниеОшибки(),,,,);
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

&наСервере
Процедура ПолучитьКадровыеДанные() Экспорт
	
	Соединение = ПолучитьПодключениеКФайловойБД();
	
	СписокПолей = "Наименование, Код, Должность, Подразделение, ДатаУвольнения";
	ПараметрыПолучения = Соединение.КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Соединение.ОбщегоНазначения.ОбщийМодуль("Справочники.Организации").ОрганизацияПоУмолчанию();
	//ПараметрыПолучения.НачалоПериода = НачалоМесяца(ТекущаяДата());
	ПараметрыПолучения.ОкончаниеПериода = КонецМесяца(ТекущаяДата());
	ПараметрыПолучения.Вставить("Отборы"); 
	ПараметрыПолучения.КадровыеДанные  = СписокПолей;
	ТаблицаСотрудников = Соединение.КадровыйУчет.СотрудникиОрганизации(Истина,ПараметрыПолучения);
	
	Для Каждого СтрокаТаблицыСотрудников Из ТаблицаСотрудников Цикл
		
		//Получить из справочника сотрудника или создать нового
		Если Справочники.Сотрудники.НайтиПоРеквизиту("Должность", Справочники.Должности.НайтиПоНаименованию(СтрокаТаблицыСотрудников.Должность.Наименование)) = Справочники.Сотрудники.ПустаяСсылка() 
			И Справочники.Сотрудники.НайтиПоКоду(СтрокаТаблицыСотрудников.Код) = Справочники.Сотрудники.ПустаяСсылка() Тогда  		 
			НоваяСтрокаСотрудники = Справочники.Сотрудники.СоздатьЭлемент();
		ИначеЕсли Не Справочники.Сотрудники.НайтиПоКоду(СтрокаТаблицыСотрудников.Код) = Справочники.Сотрудники.ПустаяСсылка() Тогда
			
			НоваяСтрокаСотрудники = Справочники.Сотрудники.НайтиПоКоду(СтрокаТаблицыСотрудников.Код).ПолучитьОбъект();
			
		ИначеЕсли Не Справочники.Сотрудники.НайтиПоРеквизиту("ПолноеНаименование", СтрокаТаблицыСотрудников.Наименование) = Справочники.Сотрудники.ПустаяСсылка() Тогда
			
			НоваяСтрокаСотрудники = Справочники.Сотрудники.НайтиПоРеквизиту("ПолноеНаименование", СтрокаТаблицыСотрудников.Наименование).ПолучитьОбъект();
			
		ИначеЕсли Не Справочники.Сотрудники.НайтиПоНаименованию(ОбщийСправочникиКлиентСервер.ФамилияИнициалы(СтрокаТаблицыСотрудников.Наименование,,,,Истина)) = Справочники.Сотрудники.ПустаяСсылка() Тогда
			
			НоваяСтрокаСотрудники = Справочники.Сотрудники.НайтиПоНаименованию(ОбщийСправочникиКлиентСервер.ФамилияИнициалы(СтрокаТаблицыСотрудников.Наименование,,,,Истина)).ПолучитьОбъект();
			
		Иначе
			НоваяСтрокаСотрудники = Справочники.Сотрудники.СоздатьЭлемент();
		КонецЕсли;
		//-------------------
		
		НоваяСтрокаСотрудники.Код = СтрокаТаблицыСотрудников.Код; 
		
		НоваяСтрокаСотрудники.Наименование = ОбщийСправочникиКлиентСервер.ФамилияИнициалы(СтрокаТаблицыСотрудников.Наименование,,,,Истина);
		
		НоваяСтрокаСотрудники.ПолноеНаименование = СтрокаТаблицыСотрудников.Наименование;
		
		НоваяСтрокаСотрудники.Должность = СоздатьДолжность(СтрокаТаблицыСотрудников.Должность);
		
		Если Не НоваяСтрокаСотрудники.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("САПР") Тогда 
			НоваяСтрокаСотрудники.Подразделение = СоздатьПодразделение(СтрокаТаблицыСотрудников.Подразделение);
		КонецЕсли;
		
		Если Не СтрокаТаблицыСотрудников.ДатаУвольнения =  Дата(1, 1, 1, 0, 0, 0) Тогда
			НоваяСтрокаСотрудники.Уволен = Истина;
		Иначе
			НоваяСтрокаСотрудники.Уволен = Ложь;
		КонецЕсли;
		
		НоваяСтрокаСотрудники.Записать();
		
	КонецЦикла;
КонецПроцедуры

&наСервере
Функция СоздатьДолжность(Должность) 
	Если Не Должность.Наименование = Справочники.Должности.НайтиПоНаименованию(Должность.Наименование).Наименование Тогда
		НоваяДолжность = Справочники.Должности.СоздатьЭлемент();
		НоваяДолжность.Наименование = Должность.Наименование;
		НоваяДолжность.Записать();
		
		Возврат НоваяДолжность.Ссылка;
	Иначе
		НоваяДолжность = Справочники.Должности.НайтиПоНаименованию(Должность.Наименование);
		Возврат НоваяДолжность.Ссылка;
	КонецЕсли;
КонецФункции

&наСервере
Функция СоздатьПодразделение(Подразделение) 
	Если Подразделение.Наименование = Справочники.Подразделения.НайтиПоРеквизиту("ПолноеНаименование",Подразделение.Наименование).ПолноеНаименование Тогда
		НовоеПодразделение = Справочники.Подразделения.НайтиПоРеквизиту("ПолноеНаименование",Подразделение.Наименование);
		Возврат НовоеПодразделение.Ссылка;
	ИначеЕсли Подразделение.Наименование = Справочники.Подразделения.НайтиПоНаименованию(Подразделение.Наименование).Наименование Тогда
		НовоеПодразделение = Справочники.Подразделения.НайтиПоНаименованию(Подразделение.Наименование);
		Возврат НовоеПодразделение.Ссылка;
	Иначе
		НовоеПодразделение = Справочники.Подразделения.СоздатьЭлемент();
		НовоеПодразделение.Наименование = Подразделение.Наименование;
		НовоеПодразделение.Записать();
		
		Возврат НовоеПодразделение.Ссылка;	
	КонецЕсли;

КонецФункции


Процедура РегламентноеОбновлениеСотрудников() Экспорт
	ПолучитьКадровыеДанные();
КонецПроцедуры
